apache/nuttx/arch/arm/src/common/stm32/stm32_i2c_v2.c
#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>
#include <nuttx/power/pm.h>
#include <nuttx/i2c/i2c_master.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "stm32_rcc.h"
#include "stm32_i2c.h"
#include "stm32.h"

/* At least one I2C peripheral must be enabled */

#if defined(CONFIG_STM32_I2C1) || defined(CONFIG_STM32_I2C2) || \
    defined(CONFIG_STM32_I2C3) || defined(CONFIG_STM32_I2C4)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#warning TODO: check I2C clock source. It must be HSI!
#undef INVALID_CLOCK_SOURCE

#if defined(CONFIG_ARCH_CHIP_STM32H7)
#  if defined(CONFIG_STM32_I2C1) || defined(CONFIG_STM32_I2C2) || \
      defined(CONFIG_STM32_I2C3)
#    if STM32_RCC_D2CCIP2R_I2C123SRC != RCC_D2CCIP2R_I2C123SEL_HSI
#      warning "Clock Source STM32_RCC_D2CCIP2R_I2C123SRC must be HSI"
#      define INVALID_CLOCK_SOURCE
#    endif
#  endif
#  ifdef CONFIG_STM32_I2C4
#    if STM32_RCC_D3CCIPR_I2C4SRC != RCC_D3CCIPR_I2C4SEL_HSI
#      warning "Clock Source STM32_RCC_D3CCIPR_I2C4SRC must be HSI"
#      define INVALID_CLOCK_SOURCE
#    endif
#  endif
#  if STM32_HSI_FREQUENCY != 16000000 || defined(INVALID_CLOCK_SOURCE)
#    error STM32_I2C: Peripheral clock is HSI and it must be 16MHz or the speed/timing calculations need to be redone.
#  endif
#elif defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F33XX) || \
    defined(CONFIG_STM32_STM32F37XX)
#  if STM32_HSI_FREQUENCY != 8000000 || defined(INVALID_CLOCK_SOURCE)
#    error STM32_I2C: Peripheral clock is HSI and it must be 8MHz or the speed/timing calculations need to be redone.
#  endif
#elif defined(CONFIG_STM32_STM32G4XXX)
#  if STM32_HSI_FREQUENCY != 16000000 || defined(INVALID_CLOCK_SOURCE)
#    error STM32_I2C: Peripheral clock is HSI and it must be 16MHz or the speed/timing calculations need to be redone.
#  endif
#else
#  error STM32_I2C: Device not Supported.
#endif

/* The I2C peripherals sit on different RCC buses depending on the family.
 * Dispatch on the RCC register macros the family header provides.
 */

#if defined(RCC_APB1LENR_I2C1EN)
#  define STM32_I2C123_CLK_REG    STM32_RCC_APB1LENR
#  define STM32_I2C123_RST_REG    STM32_RCC_APB1LRSTR
#  define STM32_I2C1_CLK_BIT      RCC_APB1LENR_I2C1EN
#  define STM32_I2C1_RST_BIT      RCC_APB1LRSTR_I2C1RST
#  define STM32_I2C2_CLK_BIT      RCC_APB1LENR_I2C2EN
#  define STM32_I2C2_RST_BIT      RCC_APB1LRSTR_I2C2RST
#  define STM32_I2C3_CLK_BIT      RCC_APB1LENR_I2C3EN
#  define STM32_I2C3_RST_BIT      RCC_APB1LRSTR_I2C3RST
#  define STM32_I2C4_CLK_REG      STM32_RCC_APB4ENR
#  define STM32_I2C4_RST_REG      STM32_RCC_APB4RSTR
#  define STM32_I2C4_CLK_BIT      RCC_APB4ENR_I2C4EN
#  define STM32_I2C4_RST_BIT      RCC_APB4RSTR_I2C4RST
#else
#  define STM32_I2C123_CLK_REG    STM32_RCC_APB1ENR
#  define STM32_I2C123_RST_REG    STM32_RCC_APB1RSTR
#  define STM32_I2C1_CLK_BIT      RCC_APB1ENR_I2C1EN
#  define STM32_I2C1_RST_BIT      RCC_APB1RSTR_I2C1RST
#  define STM32_I2C2_CLK_BIT      RCC_APB1ENR_I2C2EN
#  define STM32_I2C2_RST_BIT      RCC_APB1RSTR_I2C2RST
#  define STM32_I2C3_CLK_BIT      RCC_APB1ENR_I2C3EN
#  define STM32_I2C3_RST_BIT      RCC_APB1RSTR_I2C3RST
#  ifdef CONFIG_STM32_I2C4
#    define STM32_I2C4_CLK_REG    STM32_RCC_APB1ENR
#    define STM32_I2C4_RST_REG    STM32_RCC_APB1RSTR
#    define STM32_I2C4_CLK_BIT    RCC_APB1ENR_I2C4EN
#    define STM32_I2C4_RST_BIT    RCC_APB1RSTR_I2C4RST
#  endif
#endif

/* CONFIG_I2C_POLLED may be set so that I2C interrupts will not be used.
 * Instead, CPU-intensive polling will be used.
 */

/* Interrupt wait timeout in seconds and milliseconds */

#if !defined(CONFIG_STM32_I2CTIMEOSEC) && !defined(CONFIG_STM32_I2CTIMEOMS)
#  define CONFIG_STM32_I2CTIMEOSEC 0
#  define CONFIG_STM32_I2CTIMEOMS  500   /* Default is 500 milliseconds */
#  warning "Using Default 500 Ms Timeout"
#elif !defined(CONFIG_STM32_I2CTIMEOSEC)
#  define CONFIG_STM32_I2CTIMEOSEC 0     /* User provided milliseconds */
#elif !defined(CONFIG_STM32_I2CTIMEOMS)
#  define CONFIG_STM32_I2CTIMEOMS  0     /* User provided seconds */
#endif

/* Interrupt wait time timeout in system timer ticks */

#ifndef CONFIG_STM32_I2CTIMEOTICKS
#  define CONFIG_STM32_I2CTIMEOTICKS \
    (SEC2TICK(CONFIG_STM32_I2CTIMEOSEC) + MSEC2TICK(CONFIG_STM32_I2CTIMEOMS))
#endif

#ifndef CONFIG_STM32_I2C_DYNTIMEO_STARTSTOP
#  define CONFIG_STM32_I2C_DYNTIMEO_STARTSTOP TICK2USEC(CONFIG_STM32_I2CTIMEOTICKS)
#endif

/* Macros to convert a I2C pin to a GPIO output */

#define I2C_OUTPUT (GPIO_OUTPUT | GPIO_FLOAT | GPIO_OPENDRAIN |\
                      GPIO_SPEED_50MHz | GPIO_OUTPUT_SET)

#define MKI2C_OUTPUT(p) (((p) & (GPIO_PORT_MASK | GPIO_PIN_MASK)) | I2C_OUTPUT)

#define I2C_CR1_TXRX      (I2C_CR1_RXIE | I2C_CR1_TXIE)
#define I2C_CR1_ALLINTS   (I2C_CR1_TXRX | I2C_CR1_TCIE | I2C_CR1_ERRIE)

/* Unused bit in I2c_ISR used to communicate a bad state has occurred in
 * the isr processing
 */

#define I2C_INT_BAD_STATE 0x8000000

/* I2C event tracing
 *
 * To enable tracing statements which show the details of the state machine
 * enable the following configuration variable:
 *
 * CONFIG_I2C_TRACE
 *
 * Note: This facility uses syslog, which sends output to the console by
 * default.  No other debug configuration variables are required.
 */

#ifndef CONFIG_I2C_TRACE
#  define stm32_i2c_tracereset(p)
#  define stm32_i2c_tracenew(p,s)
#  define stm32_i2c_traceevent(p,e,a)
#  define stm32_i2c_tracedump(p)
#endif

#ifndef CONFIG_I2C_NTRACE
#  define CONFIG_I2C_NTRACE 32
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Interrupt state */

